### PANDAS LIBRARY ###

# IF NOT WITH THE ANANCONDA THEN WE SHOULD INSTALL FROM ANACONDA TERMINAL-----> pip install pandas

# PANDAS USE :
1.
# PANDAS DATA STRUCTURE OR OBJECT CREATION :
1..DataFrame(# dict_name)----> used for 2D (rows & columns creation)----->it is a class
    #CAN BE WRITTEN AS ALSO WHEN WE PROVIDE THE INDEX
    .DataFrame(dict_name,index=index_name)

2..Series(#dict_name)--------> used for 1D (only rows creation)-------> it is a class
    #CAN BE WRITTEN AS WHEN WE PROVIDE THE INDEX
    .Series(dict_name,index=index_name)

## 05-08-2025 practice on
1.pandas import
2.pandas as alias name use
3.DataFrame() use
  3.0 empty DataFrame call
  3.1 head()
  3.2 info()
  3.3 tail()
  3.4 describe()
  3.5 loc()
  3.6 iloc()

4.Series()use
  4.0 empty Series call
  4.1 head()
  4.2 info()
  4.3 tail()
  4.4 describe()
  4.5 loc()
  4.6 iloc()

In [2]:
import pandas 
print(("hello"))

hello

In [4]:
import pandas as pd
st="hello world"
print(st)

hello world

In [6]:
import pandas as pd
st1=pd.DataFrame()
print(st1)

Empty DataFrame
Columns: []
Index: []

In [8]:
import pandas as pd
st2=pd.DataFrame()
print(st2.head(1))

Empty DataFrame
Columns: []
Index: []

In [9]:
import pandas as pd
st3=pd.DataFrame()
print(st3.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 0 entries
Empty DataFrame
None

In [11]:
import pandas as pd
st4=pd.DataFrame()
print(st4.tail(2))

Empty DataFrame
Columns: []
Index: []

In [12]:
import pandas as pd
st5=pd.DataFrame()
print(st5.describe())

ValueError: Cannot describe a DataFrame without columns

In [14]:
import pandas as pd
dict_1={
    "name":"talib ansari",
    "phone":"redmi",
    "price":10000,
    "location":"mauganj"
}
d=pd.DataFrame(dict_1)
print(d)

ValueError: If using all scalar values, you must pass an index

In [15]:
import pandas as pd
dict_1={
    "name":"talib ansari",
    "phone":"redmi",
    "price":10000,
    "location":"mauganj"
}
d=pd.Series(dict_1)
print(d)

name        talib ansari
phone              redmi
price              10000
location         mauganj
dtype: object

In [17]:
import pandas as pd
dict_1={
    "name":"talib ansari",
    "phone":"redmi",
    "price":10000,
    "location":"mauganj"
}
idx=[0]
d=pd.DataFrame(dict_1,index=idx)
print(d)

           name  phone  price location
0  talib ansari  redmi  10000  mauganj

In [19]:
import pandas as pd
dict_1={
    "name":["talib ansari","vipul","anil","raj"],
    "phone":["redmi","motorola","redmi-8","oppo"],
    "price":[10000,20000,10000,15000],
    "location":["mauganj","rewa","devtalab","bhopal"]
}
#idx=[0]
d=pd.DataFrame(dict_1)
print(d)

           name     phone  price  location
0  talib ansari     redmi  10000   mauganj
1         vipul  motorola  20000      rewa
2          anil   redmi-8  10000  devtalab
3           raj      oppo  15000    bhopal

In [20]:
import pandas as pd
dict_1={
    "name":["talib ansari","vipul","anil","raj"],
    "phone":["redmi","motorola","redmi-8","oppo"],
    "price":[10000,20000,10000,15000],
    "location":["mauganj","rewa","devtalab","bhopal"]
}
idx=[0]
d=pd.DataFrame(dict_1,index=idx)
print(d)

ValueError: Length of values (4) does not match length of index (1)

In [21]:
import pandas as pd
dict_1={
    "name":["talib ansari","vipul","anil","raj"],
    "phone":["redmi","motorola","redmi-8","oppo"],
    "price":[10000,20000,10000,15000],
    "location":["mauganj","rewa","devtalab","bhopal"]
}
idx=[0,1,2,3,4]
d=pd.DataFrame(dict_1,index=idx)
print(d)

ValueError: Length of values (4) does not match length of index (5)

In [28]:
import pandas as pd
dict_1={
    #"sr-no":idx,
    "name":["talib ansari","vipul","anil","raj"],
    "phone":["redmi","motorola","redmi-8","oppo"],
    "price":[10000,20000,10000,15000],
    "location":["mauganj","rewa","devtalab","bhopal"]
}
idx=["buyer_1","buyer_2","buyer_3","buyer_4"]
d=pd.DataFrame(dict_1,index=idx)
print(d)

                 name     phone  price  location
buyer_1  talib ansari     redmi  10000   mauganj
buyer_2         vipul  motorola  20000      rewa
buyer_3          anil   redmi-8  10000  devtalab
buyer_4           raj      oppo  15000    bhopal

In [29]:
import pandas as pd
dict_1={
    "sr-no":idx,
    "name":["talib ansari","vipul","anil","raj"],
    "phone":["redmi","motorola","redmi-8","oppo"],
    "price":[10000,20000,10000,15000],
    "location":["mauganj","rewa","devtalab","bhopal"]
}
idx=["buyer_1","buyer_2","buyer_3","buyer_4"]
d=pd.DataFrame(dict_1)
print(d)

     sr-no          name     phone  price  location
0  buyer_1  talib ansari     redmi  10000   mauganj
1  buyer_2         vipul  motorola  20000      rewa
2  buyer_3          anil   redmi-8  10000  devtalab
3  buyer_4           raj      oppo  15000    bhopal

In [30]:
import pandas as pd
dict_1={
    #"sr-no":idx,
    "name":["talib ansari","vipul","anil","raj"],
    "phone":["redmi","motorola","redmi-8","oppo"],
    "price":[10000,20000,10000,15000],
    "location":["mauganj","rewa","devtalab","bhopal"]
}
idx=["buyer_1","buyer_2","buyer_3","buyer_4"]
d=pd.DataFrame(dict_1,index=idx)
d.head(2)

                 name     phone  price location
buyer_1  talib ansari     redmi  10000  mauganj
buyer_2         vipul  motorola  20000     rewa

In [31]:
import pandas as pd
dict_1={
    #"sr-no":idx,
    "name":["talib ansari","vipul","anil","raj"],
    "phone":["redmi","motorola","redmi-8","oppo"],
    "price":[10000,20000,10000,15000],
    "location":["mauganj","rewa","devtalab","bhopal"]
}
idx=["buyer_1","buyer_2","buyer_3","buyer_4"]
d=pd.DataFrame(dict_1,index=idx)
d.tail(2)

         name    phone  price  location
buyer_3  anil  redmi-8  10000  devtalab
buyer_4   raj     oppo  15000    bhopal

In [32]:
import pandas as pd
dict_1={
    #"sr-no":idx,
    "name":["talib ansari","vipul","anil","raj"],
    "phone":["redmi","motorola","redmi-8","oppo"],
    "price":[10000,20000,10000,15000],
    "location":["mauganj","rewa","devtalab","bhopal"]
}
idx=["buyer_1","buyer_2","buyer_3","buyer_4"]
d=pd.DataFrame(dict_1,index=idx)
d

                 name     phone  price  location
buyer_1  talib ansari     redmi  10000   mauganj
buyer_2         vipul  motorola  20000      rewa
buyer_3          anil   redmi-8  10000  devtalab
buyer_4           raj      oppo  15000    bhopal

In [33]:
import pandas as pd
dict_1={
    #"sr-no":idx,
    "name":["talib ansari","vipul","anil","raj"],
    "phone":["redmi","motorola","redmi-8","oppo"],
    "price":[10000,20000,10000,15000],
    "location":["mauganj","rewa","devtalab","bhopal"]
}
idx=["buyer_1","buyer_2","buyer_3","buyer_4"]
d=pd.DataFrame(dict_1,index=idx)
d.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, buyer_1 to buyer_4
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      4 non-null      object
 1   phone     4 non-null      object
 2   price     4 non-null      int64
 3   location  4 non-null      object
dtypes: int64(1), object(3)
memory usage: 160.0+ bytes

In [38]:
import pandas as pd
dict_1={
    #"sr-no":idx,
    "name":["talib ansari","vipul","anil","raj"],
    "phone":["redmi","motorola","redmi-8","oppo"],
    "price":[10000,20000,10000,15000],
    "location":["mauganj","rewa","devtalab","bhopal"]
}
idx=["buyer_1","buyer_2","buyer_3","buyer_4"]
d=pd.DataFrame(dict_1,index=idx)
d.describe()

              price
count      4.000000
mean   13750.000000
std     4787.135539
min    10000.000000
25%    10000.000000
50%    12500.000000
75%    16250.000000
max    20000.000000

In [41]:
import pandas as pd
dict_1={
    #"sr-no":idx,
    "name":["talib ansari","vipul","anil","raj"],
    "phone":["redmi","motorola","redmi-8","oppo"],
    "price":[10000,20000,10000,15000],
    "location":["mauganj","rewa","devtalab","bhopal"]
}
idx=["buyer_1","buyer_2","buyer_3","buyer_4"]
d=pd.DataFrame(dict_1,index=idx)
d["name"]

buyer_1    talib ansari
buyer_2           vipul
buyer_3            anil
buyer_4             raj
Name: name, dtype: object

In [46]:
import pandas as pd
dict_1={
    #"sr-no":idx,
    "name":["talib ansari","vipul","anil","raj"],
    "phone":["redmi","motorola","redmi-8","oppo"],
    "price":[10000,20000,10000,15000],
    "location":["mauganj","rewa","devtalab","bhopal"]
}
idx=["buyer_1","buyer_2","buyer_3","buyer_4"]
d=pd.DataFrame(dict_1,index=idx)
d.loc[0]

KeyError: 0

In [48]:
import pandas as pd
dict_1={
    #"sr-no":idx,
    "name":["talib ansari","vipul","anil","raj"],
    "phone":["redmi","motorola","redmi-8","oppo"],
    "price":[10000,20000,10000,15000],
    "location":["mauganj","rewa","devtalab","bhopal"]
}
idx=["buyer_1","buyer_2","buyer_3","buyer_4"]
d=pd.DataFrame(dict_1,index=idx)
d.loc["buyer_1"]

name        talib ansari
phone              redmi
price              10000
location         mauganj
Name: buyer_1, dtype: object

In [50]:
import pandas as pd
dict_1={
    #"sr-no":idx,
    "name":["talib ansari","vipul","anil","raj"],
    "phone":["redmi","motorola","redmi-8","oppo"],
    "price":[10000,20000,10000,15000],
    "location":["mauganj","rewa","devtalab","bhopal"]
}
#idx=["buyer_1","buyer_2","buyer_3","buyer_4"]
d=pd.DataFrame(dict_1,)
d.loc[1]

name           vipul
phone       motorola
price          20000
location        rewa
Name: 1, dtype: object

In [54]:
import pandas as pd
dict_1={
    #"sr-no":idx,
    "name":["talib ansari","vipul","anil","raj"],
    "phone":["redmi","motorola","redmi-8","oppo"],
    "price":[10000,20000,10000,15000],
    "location":["mauganj","rewa","devtalab","bhopal"]
}
#idx=["buyer_1","buyer_2","buyer_3","buyer_4"]
d=pd.DataFrame(dict_1,)
d.iloc[3]

name           raj
phone         oppo
price        15000
location    bhopal
Name: 3, dtype: object

In [55]:
import pandas as pd
dict_1={
    #"sr-no":idx,
    "name":["talib ansari","vipul","anil","raj"],
    "phone":["redmi","motorola","redmi-8","oppo"],
    "price":[10000,20000,10000,15000],
    "location":["mauganj","rewa","devtalab","bhopal"]
}
#idx=["buyer_1","buyer_2","buyer_3","buyer_4"]
d=pd.DataFrame(dict_1,)
d.iloc[:]

           name     phone  price  location
0  talib ansari     redmi  10000   mauganj
1         vipul  motorola  20000      rewa
2          anil   redmi-8  10000  devtalab
3           raj      oppo  15000    bhopal

In [56]:
import pandas as pd
dict_1={
    #"sr-no":idx,
    "name":["talib ansari","vipul","anil","raj"],
    "phone":["redmi","motorola","redmi-8","oppo"],
    "price":[10000,20000,10000,15000],
    "location":["mauganj","rewa","devtalab","bhopal"]
}
#idx=["buyer_1","buyer_2","buyer_3","buyer_4"]
d=pd.DataFrame(dict_1,)
d.iloc[:2]

           name     phone  price location
0  talib ansari     redmi  10000  mauganj
1         vipul  motorola  20000     rewa

In [58]:
import pandas as pd
dict_1={
    #"sr-no":idx,
    "name":["talib ansari","vipul","anil","raj"],
    "phone":["redmi","motorola","redmi-8","oppo"],
    "price":[10000,20000,10000,15000],
    "location":["mauganj","rewa","devtalab","bhopal"]
}
idx=["buyer_1","buyer_2","buyer_3","buyer_4"]
d=pd.DataFrame(dict_1,index=idx)
print(d.iloc[1,2])

20000

In [59]:
import pandas as pd
dict_1={
    #"sr-no":idx,
    "name":["talib ansari","vipul","anil","raj"],
    "phone":["redmi","motorola","redmi-8","oppo"],
    "price":[10000,20000,10000,15000],
    "location":["mauganj","rewa","devtalab","bhopal"]
}
idx=["buyer_1","buyer_2","buyer_3","buyer_4"]
d=pd.DataFrame(dict_1,index=idx)
print(d.iloc[:,0:1])

                 name
buyer_1  talib ansari
buyer_2         vipul
buyer_3          anil
buyer_4           raj

In [61]:
import pandas as pd
dict_1={
    #"sr-no":idx,
    "name":["talib ansari","vipul","anil","raj"],
    "phone":["redmi","motorola","redmi-8","oppo"],
    "price":[10000,20000,10000,15000],
    "location":["mauganj","rewa","devtalab","bhopal"]
}
idx=["buyer_1","buyer_2","buyer_3","buyer_4"]
d=pd.DataFrame(dict_1,index=idx)
print(d.iloc[[1,2],[2,1]])

         price     phone
buyer_2  20000  motorola
buyer_3  10000   redmi-8

In [62]:
import pandas as pd
dict_1={
    #"sr-no":idx,
    "name":["talib ansari","vipul","anil","raj"],
    "phone":["redmi","motorola","redmi-8","oppo"],
    "price":[10000,20000,10000,15000],
    "location":["mauganj","rewa","devtalab","bhopal"]
}
idx=["buyer_1","buyer_2","buyer_3","buyer_4"]
d=pd.DataFrame(dict_1,index=idx)
d

                 name     phone  price  location
buyer_1  talib ansari     redmi  10000   mauganj
buyer_2         vipul  motorola  20000      rewa
buyer_3          anil   redmi-8  10000  devtalab
buyer_4           raj      oppo  15000    bhopal

# Series

In [63]:
import pandas as pd
price=[10000,20000,10000,15000]
sr_d=pd.Series(price)
sr_d

0    10000
1    20000
2    10000
3    15000
dtype: int64

In [64]:
import pandas as pd
new_price=[]
sr_n=pd.Series(new_price)
sr_n

Series([], dtype: object)

In [65]:
import pandas as pd
new_price=[]
sr_n=pd.Series(new_price)
sr_n.head()

Series([], dtype: object)

In [66]:
import pandas as pd
new_price=[]
sr_n=pd.Series(new_price)
sr_n.tail()

Series([], dtype: object)

In [67]:
import pandas as pd
new_price=[]
sr_n=pd.Series(new_price)
sr_n.describe()

count       0
unique      0
top       NaN
freq      NaN
dtype: object

In [68]:
import pandas as pd
new_price=[]
sr_n=pd.Series(new_price)
sr_n.info()

<class 'pandas.core.series.Series'>
RangeIndex: 0 entries
Series name: None
Non-Null Count  Dtype
--------------  -----
0 non-null      object
dtypes: object(1)
memory usage: 132.0+ bytes

In [69]:
import pandas as pd
new_price=[]
sr_n=pd.Series(new_price)
sr_n.loc[0]

KeyError: 0

In [71]:
import pandas as pd
new_price=[]
sr_n=pd.Series(new_price)
sr_n.iloc[0]

IndexError: single positional indexer is out-of-bounds

In [72]:
import pandas as pd
list_speed=[[20,30],[40,50],[60,70]]
sr_list=pd.Series(list_speed)
sr_list

0    [20, 30]
1    [40, 50]
2    [60, 70]
dtype: object

In [75]:
import pandas as pd
list_speed=[[20,30],[40,50],[60,70]]
sr_list,*sr_list1=pd.Series(list_speed)
sr_list,sr_list1

([20, 30], [[40, 50], [60, 70]])

In [79]:
import pandas as pd
list_speed=[[20,30],[40,50],[60,70]]
sr_list,*sr_list1=pd.Series(list_speed)
sr_list,sr_list1.describe()

AttributeError: 'list' object has no attribute 'describe'

In [82]:
import pandas as pd
list_speed=[[20,30],[40,50],[60,70]]
sr_list1=pd.Series(list_speed)
print(*sr_list1)

[20, 30] [40, 50] [60, 70]

In [84]:
import pandas as pd
list_speed=[[20,30],[40,50],[60,70]]
idx=[0,1,2]
sr_list1=pd.Series(list_speed,index=idx)
print(*sr_list1)

[20, 30] [40, 50] [60, 70]

In [85]:
import pandas as pd
list_speed=[[20,30],[40,50],[60,70]]
sr_list1=pd.Series(list_speed)
print(*sr_list1.head(1))

[20, 30]

In [86]:
import pandas as pd
list_speed=[[20,30],[40,50],[60,70]]
sr_list1=pd.Series(list_speed)
print(*sr_list1.tail(1))

[60, 70]

In [88]:
import pandas as pd
list_speed=[[20,30],[40,50],[60,70]]
sr_list1=pd.Series(list_speed)
print(*sr_list1.info())

<class 'pandas.core.series.Series'>
RangeIndex: 3 entries, 0 to 2
Series name: None
Non-Null Count  Dtype
--------------  -----
3 non-null      object
dtypes: object(1)
memory usage: 156.0+ bytes

TypeError: print() argument after * must be an iterable, not NoneType

In [89]:
import pandas as pd
list_speed=[[20,30],[40,50],[60,70]]
sr_list1=pd.Series(list_speed)
print(*sr_list1.describe())

3 3 [20, 30] 1

# DataFrame

In [90]:
import pandas as pd
dict_1={
    'course':["Data Science","Ai","Full-stack",".net"],
    'duration':["6 months","3-months","8-months","5-months"],
    'fee':[27000,30000,40000,25000],
    'teacher':['Jayant Kumar','manyank kumar','omkar','hariom']
}
d2=pd.DataFrame(dict_1)
d2

         course  duration    fee        teacher
0  Data Science  6 months  27000   Jayant Kumar
1            Ai  3-months  30000  manyank kumar
2    Full-stack  8-months  40000          omkar
3          .net  5-months  25000         hariom

In [92]:
import pandas as pd
dict_1={
    'course':["Data Science","Ai","Full-stack","Java.net"],
    'duration':["6 months","3-months","8-months","5-months"],
    'fee':[27000,30000,40000,25000],
    'teacher':['Jayant Kumar','manyank kumar','omkar','hariom']
}
idx=["batch-01","batch-02","batch-03","batch-04"]
d2=pd.DataFrame(dict_1,index=idx)
d2

                course  duration    fee        teacher
batch-01  Data Science  6 months  27000   Jayant Kumar
batch-02            Ai  3-months  30000  manyank kumar
batch-03    Full-stack  8-months  40000          omkar
batch-04      Java.net  5-months  25000         hariom

In [93]:
import pandas as pd
dict_1={
    'course':["Data Science","Ai","Full-stack",".net"],
    'duration':["6 months","3-months","8-months","5-months"],
    'fee':[27000,30000,40000,25000],
    'teacher':['Jayant Kumar','manyank kumar','omkar','hariom']
}
d2=pd.DataFrame(dict_1)
d2.head(2)

         course  duration    fee        teacher
0  Data Science  6 months  27000   Jayant Kumar
1            Ai  3-months  30000  manyank kumar

In [94]:
import pandas as pd
dict_1={
    'course':["Data Science","Ai","Full-stack",".net"],
    'duration':["6 months","3-months","8-months","5-months"],
    'fee':[27000,30000,40000,25000],
    'teacher':['Jayant Kumar','manyank kumar','omkar','hariom']
}
d2=pd.DataFrame(dict_1)
d2.tail(3)

       course  duration    fee        teacher
1          Ai  3-months  30000  manyank kumar
2  Full-stack  8-months  40000          omkar
3        .net  5-months  25000         hariom

In [95]:
import pandas as pd
dict_1={
    'course':["Data Science","Ai","Full-stack",".net"],
    'duration':["6 months","3-months","8-months","5-months"],
    'fee':[27000,30000,40000,25000],
    'teacher':['Jayant Kumar','manyank kumar','omkar','hariom']
}
d2=pd.DataFrame(dict_1)
d2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   course    4 non-null      object
 1   duration  4 non-null      object
 2   fee       4 non-null      int64
 3   teacher   4 non-null      object
dtypes: int64(1), object(3)
memory usage: 260.0+ bytes

In [99]:
import pandas as pd
dict_1={
    'course':["Data Science","Ai","Full-stack",".net"],
    'duration':["6 months","3-months","8-months","5-months"],
    'fee':[27000,30000,40000,25000],
    'teacher':['Jayant Kumar','manyank kumar','omkar','hariom']
}
d2=pd.DataFrame(dict_1)
d2.describe()

                fee
count      4.000000
mean   30500.000000
std     6658.328118
min    25000.000000
25%    26500.000000
50%    28500.000000
75%    32500.000000
max    40000.000000

In [100]:
import pandas as pd
dict_1={
    'course':["Data Science","Ai","Full-stack","Java.net"],
    'duration':[6 ,3,8,5],
    'fee':[27000,30000,40000,25000],
    'teacher':['Jayant Kumar','manyank kumar','omkar','hariom']
}
d2=pd.DataFrame(dict_1)
d2.describe()

       duration           fee
count  4.000000      4.000000
mean   5.500000  30500.000000
std    2.081666   6658.328118
min    3.000000  25000.000000
25%    4.500000  26500.000000
50%    5.500000  28500.000000
75%    6.500000  32500.000000
max    8.000000  40000.000000

In [102]:
import pandas as pd
farmer={
    "grains":["rice","wheat","dal","grams","corn","potato"],
    "kg_s":["10_kg","15_kg","7_kg","9_kg","5_kg","20_kg"],
    "cost":[200,150,300,350,500,100],
    "selling_price":[250,200,295,460,300,390],
    "msp":["20_rs","30_rs","60_rs","100_rs","150_rs","20_rs"],
    "communication_charge":[20,15,30,10,8,11]
}
farmer_cost=pd.DataFrame(farmer)
farmer_cost

   grains   kg_s  cost  selling_price     msp  communication_charge
0    rice  10_kg   200            250   20_rs                    20
1   wheat  15_kg   150            200   30_rs                    15
2     dal   7_kg   300            295   60_rs                    30
3   grams   9_kg   350            460  100_rs                    10
4    corn   5_kg   500            300  150_rs                     8
5  potato  20_kg   100            390   20_rs                    11

In [103]:
import pandas as pd
farmer={
    "grains":["rice","wheat","dal","grams","corn","potato"],
    "kg_s":["10_kg","15_kg","7_kg","9_kg","5_kg","20_kg"],
    "cost":[200,150,300,350,500,100],
    "selling_price":[250,200,295,460,300,390],
    "msp":["20_rs","30_rs","60_rs","100_rs","150_rs","20_rs"],
    "communication_charge":[20,15,30,10,8,11]
}
idx=["Anaj_1","Anaj_2","Anaj_3","Anaj_4","Anaj_5","Anaj_6"]
farmer_cost=pd.DataFrame(farmer,index=idx)
farmer_cost

        grains   kg_s  cost  selling_price     msp  communication_charge
Anaj_1    rice  10_kg   200            250   20_rs                    20
Anaj_2   wheat  15_kg   150            200   30_rs                    15
Anaj_3     dal   7_kg   300            295   60_rs                    30
Anaj_4   grams   9_kg   350            460  100_rs                    10
Anaj_5    corn   5_kg   500            300  150_rs                     8
Anaj_6  potato  20_kg   100            390   20_rs                    11

In [104]:
import pandas as pd
farmer={
    "grains":["rice","wheat","dal","grams","corn","potato"],
    "kg_s":["10_kg","15_kg","7_kg","9_kg","5_kg","20_kg"],
    "cost":[200,150,300,350,500,100],
    "selling_price":[250,200,295,460,300,390],
    "msp":["20_rs","30_rs","60_rs","100_rs","150_rs","20_rs"],
    "communication_charge":[20,15,30,10,8,11]
}
farmer_cost=pd.DataFrame(farmer)
farmer_cost.describe()

             cost  selling_price  communication_charge
count    6.000000       6.000000              6.000000
mean   266.666667     315.833333             15.666667
std    147.196014      94.573604              8.213810
min    100.000000     200.000000              8.000000
25%    162.500000     261.250000             10.250000
50%    250.000000     297.500000             13.000000
75%    337.500000     367.500000             18.750000
max    500.000000     460.000000             30.000000

In [105]:
import pandas as pd
farmer={
    "grains":["rice","wheat","dal","grams","corn","potato"],
    "kg_s":["10_kg","15_kg","7_kg","9_kg","5_kg","20_kg"],
    "cost":[200,150,300,350,500,100],
    "selling_price":[250,200,295,460,300,390],
    "msp":["20_rs","30_rs","60_rs","100_rs","150_rs","20_rs"],
    "communication_charge":[20,15,30,10,8,11]
}
farmer_cost=pd.DataFrame(farmer)
farmer_cost.head(2).describe()

             cost  selling_price  communication_charge
count    2.000000       2.000000              2.000000
mean   175.000000     225.000000             17.500000
std     35.355339      35.355339              3.535534
min    150.000000     200.000000             15.000000
25%    162.500000     212.500000             16.250000
50%    175.000000     225.000000             17.500000
75%    187.500000     237.500000             18.750000
max    200.000000     250.000000             20.000000

In [106]:
import pandas as pd
farmer={
    "grains":["rice","wheat","dal","grams","corn","potato"],
    "kg_s":["10_kg","15_kg","7_kg","9_kg","5_kg","20_kg"],
    "cost":[200,150,300,350,500,100],
    "selling_price":[250,200,295,460,300,390],
    "msp":["20_rs","30_rs","60_rs","100_rs","150_rs","20_rs"],
    "communication_charge":[20,15,30,10,8,11]
}
farmer_cost=pd.DataFrame(farmer)
farmer_cost.tail(3).describe()

             cost  selling_price  communication_charge
count    3.000000       3.000000              3.000000
mean   316.666667     383.333333              9.666667
std    202.072594      80.208063              1.527525
min    100.000000     300.000000              8.000000
25%    225.000000     345.000000              9.000000
50%    350.000000     390.000000             10.000000
75%    425.000000     425.000000             10.500000
max    500.000000     460.000000             11.000000

In [107]:
import pandas as pd
farmer={
    "grains":["rice","wheat","dal","grams","corn","potato"],
    "kg_s":["10_kg","15_kg","7_kg","9_kg","5_kg","20_kg"],
    "cost":[200,150,300,350,500,100],
    "selling_price":[250,200,295,460,300,390],
    "msp":["20_rs","30_rs","60_rs","100_rs","150_rs","20_rs"],
    "communication_charge":[20,15,30,10,8,11]
}
farmer_cost=pd.DataFrame(farmer)
farmer_cost.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   grains                6 non-null      object
 1   kg_s                  6 non-null      object
 2   cost                  6 non-null      int64
 3   selling_price         6 non-null      int64
 4   msp                   6 non-null      object
 5   communication_charge  6 non-null      int64
dtypes: int64(3), object(3)
memory usage: 420.0+ bytes

In [110]:
import pandas as pd
farmer={
    "grains":["rice","wheat","dal","grams","corn","potato"],
    "kg_s":["10_kg","15_kg","7_kg","9_kg","5_kg","20_kg"],
    "cost":[200,150,300,350,500,100],
    "selling_price":[250,200,295,460,300,390],
    "msp":["20_rs","30_rs","60_rs","100_rs","150_rs","20_rs"],
    "communication_charge":[20,15,30,10,8,11]
}
farmer_cost=pd.DataFrame(farmer)
farmer_cost.loc[0]

grains                   rice
kg_s                    10_kg
cost                      200
selling_price             250
msp                     20_rs
communication_charge       20
Name: 0, dtype: object

In [112]:
import pandas as pd
farmer={
    "grains":["rice","wheat","dal","grams","corn","potato"],
    "kg_s":["10_kg","15_kg","7_kg","9_kg","5_kg","20_kg"],
    "cost":[200,150,300,350,500,100],
    "selling_price":[250,200,295,460,300,390],
    "msp":["20_rs","30_rs","60_rs","100_rs","150_rs","20_rs"],
    "communication_charge":[20,15,30,10,8,11]
}
farmer_cost=pd.DataFrame(farmer)
farmer_cost.loc[1:]

   grains   kg_s  cost  selling_price     msp  communication_charge
1   wheat  15_kg   150            200   30_rs                    15
2     dal   7_kg   300            295   60_rs                    30
3   grams   9_kg   350            460  100_rs                    10
4    corn   5_kg   500            300  150_rs                     8
5  potato  20_kg   100            390   20_rs                    11

In [113]:
import pandas as pd
farmer={
    "grains":["rice","wheat","dal","grams","corn","potato"],
    "kg_s":["10_kg","15_kg","7_kg","9_kg","5_kg","20_kg"],
    "cost":[200,150,300,350,500,100],
    "selling_price":[250,200,295,460,300,390],
    "msp":["20_rs","30_rs","60_rs","100_rs","150_rs","20_rs"],
    "communication_charge":[20,15,30,10,8,11]
}
farmer_cost=pd.DataFrame(farmer)
farmer_cost.loc[2]

grains                    dal
kg_s                     7_kg
cost                      300
selling_price             295
msp                     60_rs
communication_charge       30
Name: 2, dtype: object

In [118]:
import pandas as pd
farmer={
    "grains":["rice","wheat","dal","grams","corn","potato"],
    "kg_s":["10_kg","15_kg","7_kg","9_kg","5_kg","20_kg"],
    "cost":[200,150,300,350,500,100],
    "selling_price":[250,200,295,460,300,390],
    "msp":["20_rs","30_rs","60_rs","100_rs","150_rs","20_rs"],
    "communication_charge":[20,15,30,10,8,11]
}
farmer_cost=pd.DataFrame(farmer)
print(farmer_cost.iloc[1,2])

150

In [120]:
import pandas as pd
my_shop={
    "name":["jiyaul Hak","sanam","subrati"],
    "relation":["uncle","bhai","bhai"],
    "shop":"prince tailor",
    "rent":10000
}
shop=pd.DataFrame(my_shop)
shop

         name relation           shop   rent
0  jiyaul Hak    uncle  prince tailor  10000
1       sanam     bhai  prince tailor  10000
2     subrati     bhai  prince tailor  10000

In [121]:
import pandas as pd
my_shop={
    "name":["jiyaul Hak","sanam","subrati"],
    "relation":["uncle","bhai","bhai"],
    "shop":"prince tailor",
    "rent":10000
}
idx=["tailor_1","tailor_2","tailor_3"]
shop=pd.DataFrame(my_shop,index=idx)
shop

                name relation           shop   rent
tailor_1  jiyaul Hak    uncle  prince tailor  10000
tailor_2       sanam     bhai  prince tailor  10000
tailor_3     subrati     bhai  prince tailor  10000

In [124]:
import pandas as pd
my_shop={
    "name":["jiyaul Hak","sanam","subrati"],
    "relation":["uncle","bhai","bhai"],
    "shop":"prince tailor",
    "rent":10000
}
idx=["tailor_1","tailor_2","tailor_3"]
shop=pd.DataFrame(my_shop,index=idx)
shop.head(-1)

                name relation           shop   rent
tailor_1  jiyaul Hak    uncle  prince tailor  10000
tailor_2       sanam     bhai  prince tailor  10000

In [128]:
import pandas as pd
my_shop={
    "name":["jiyaul Hak","sanam","subrati"],
    "relation":["uncle","bhai","bhai"],
    "shop":"prince tailor",
    "rent":10000
}
idx=["tailor_1","tailor_2","tailor_3"]
shop=pd.DataFrame(my_shop,index=idx)
shop.head(-4)

Empty DataFrame
Columns: [name, relation, shop, rent]
Index: []

In [132]:
import pandas as pd
my_shop={
    "name":["jiyaul Hak","sanam","subrati"],
    "relation":["uncle","bhai","bhai"],
    "shop":"prince tailor",
    "rent":10000
}
idx=["tailor_1","tailor_2","tailor_3"]
shop=pd.DataFrame(my_shop,index=idx)
shop.tail(-1)

             name relation           shop   rent
tailor_2    sanam     bhai  prince tailor  10000
tailor_3  subrati     bhai  prince tailor  10000

In [139]:
import pandas as pd
my_shop={
    "name":["jiyaul Hak","sanam","subrati"],
    "relation":["uncle","bhai","bhai"],
    "shop":"prince tailor",
    "rent":10000
}
idx=["tailor_1","tailor_2","tailor_3"]
shop=pd.DataFrame(my_shop,index=idx)
shop.tail(-2)

             name relation           shop   rent
tailor_3  subrati     bhai  prince tailor  10000

In [140]:
import pandas as pd
my_shop={
    "name":["jiyaul Hak","sanam","subrati"],
    "relation":["uncle","bhai","bhai"],
    "shop":"prince tailor",
    "rent":10000
}
idx=["tailor_1","tailor_2","tailor_3"]
shop=pd.DataFrame(my_shop,index=idx)
shop.describe()

          rent
count      3.0
mean   10000.0
std        0.0
min    10000.0
25%    10000.0
50%    10000.0
75%    10000.0
max    10000.0

In [141]:
import pandas as pd
my_shop={
    "name":["jiyaul Hak","sanam","subrati"],
    "relation":["uncle","bhai","bhai"],
    "shop":"prince tailor",
    "rent":10000
}
idx=["tailor_1","tailor_2","tailor_3"]
shop=pd.DataFrame(my_shop,index=idx)
shop.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, tailor_1 to tailor_3
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      3 non-null      object
 1   relation  3 non-null      object
 2   shop      3 non-null      object
 3   rent      3 non-null      int64
dtypes: int64(1), object(3)
memory usage: 120.0+ bytes

In [143]:
bat_company={
    "Bat":["MRF","CEAT","REBOOKE","SS"],
    "Signed":["Virat_Kohli","Rohit_Sharma","Mahendra_singh_Dhoni","Surya_kumar_Yadav"],
    "Game":["ipl","icc","series","county"],
    "Purachse":[20000,15000,10000,12000],
    "Runs":[6,"4_run","2_run","1_run"]
}
idx=["Bat_1","Bat_2","Bat_3","Bat_4"]
company_data=pd.DataFrame(bat_company,index=idx)
company_data

           Bat                Signed    Game  Purachse   Runs
Bat_1      MRF           Virat_Kohli     ipl     20000      6
Bat_2     CEAT          Rohit_Sharma     icc     15000  4_run
Bat_3  REBOOKE  Mahendra_singh_Dhoni  series     10000  2_run
Bat_4       SS     Surya_kumar_Yadav  county     12000  1_run

In [144]:
bat_company={
    "Bat":["MRF","CEAT","REBOOKE","SS"],
    "Signed":["Virat_Kohli","Rohit_Sharma","Mahendra_singh_Dhoni","Surya_kumar_Yadav"],
    "Game":["ipl","icc","series","county"],
    "Purachse":[20000,15000,10000,12000],
    "Runs":[6,"4_run","2_run","1_run"]
}
idx=["Bat_1","Bat_2","Bat_3","Bat_4"]
company_data=pd.DataFrame(bat_company,index=idx)
company_data.describe()

          Purachse
count      4.00000
mean   14250.00000
std     4349.32945
min    10000.00000
25%    11500.00000
50%    13500.00000
75%    16250.00000
max    20000.00000

In [145]:
bat_company={
    "Bat":["MRF","CEAT","REBOOKE","SS"],
    "Signed":["Virat_Kohli","Rohit_Sharma","Mahendra_singh_Dhoni","Surya_kumar_Yadav"],
    "Game":["ipl","icc","series","county"],
    "Purachse":[20000,15000,10000,12000],
    "Runs":[6,"4_run","2_run","1_run"]
}
idx=["Bat_1","Bat_2","Bat_3","Bat_4"]
company_data=pd.DataFrame(bat_company,index=idx)
company_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Bat_1 to Bat_4
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Bat       4 non-null      object
 1   Signed    4 non-null      object
 2   Game      4 non-null      object
 3   Purachse  4 non-null      int64
 4   Runs      4 non-null      object
dtypes: int64(1), object(4)
memory usage: 192.0+ bytes

In [161]:
bat_company={
    "Bat":["MRF","CEAT","REBOOKE","SS"],
    "Signed":["Virat_Kohli","Rohit_Sharma","Mahendra_singh_Dhoni","Surya_kumar_Yadav"],
    "Game":["ipl","icc","series","county"],
    "Purachse":[20000,15000,10000,12000],
    "Runs":[6,"4_run","2_run","1_run"]
}
idx=["Bat_1","Bat_2","Bat_3","Bat_4"]
company_data=pd.DataFrame(bat_company,index=idx)
company_data.head(2).tail(1)

        Bat        Signed Game  Purachse   Runs
Bat_2  CEAT  Rohit_Sharma  icc     15000  4_run

In [163]:
bat_company={
    "Bat":["MRF","CEAT","REBOOKE","SS"],
    "Signed":["Virat_Kohli","Rohit_Sharma","Mahendra_singh_Dhoni","Surya_kumar_Yadav"],
    "Game":["ipl","icc","series","county"],
    "Purchase":[20000,15000,10000,12000],
    "Runs":[6,"4_run","2_run","1_run"]
}
idx=["Bat_1","Bat_2","Bat_3","Bat_4"]
company_data=pd.DataFrame(bat_company,index=idx)
company_data.tail(3).head(4)

           Bat                Signed    Game  Purchase   Runs
Bat_2     CEAT          Rohit_Sharma     icc     15000  4_run
Bat_3  REBOOKE  Mahendra_singh_Dhoni  series     10000  2_run
Bat_4       SS     Surya_kumar_Yadav  county     12000  1_run

In [182]:
bat_company={
    "Bat":["MRF","CEAT","REBOOKE","SS"],
    "Signed":["Virat_Kohli","Rohit_Sharma","Mahendra_singh_Dhoni","Surya_kumar_Yadav"],
    "Game":["ipl","icc","series","county"],
    "Purchase":[20000,15000,10000,12000],
    "Runs":[6,"4_run","2_run","1_run"]
}
#idx=["Bat_1","Bat_2","Bat_3","Bat_4"]
company_data=pd.Series(bat_company)
company_data

Bat                                  [MRF, CEAT, REBOOKE, SS]
Signed      [Virat_Kohli, Rohit_Sharma, Mahendra_singh_Dho...
Game                               [ipl, icc, series, county]
Purchase                         [20000, 15000, 10000, 12000]
Runs                                 [6, 4_run, 2_run, 1_run]
dtype: object

# shape attribute--->(rows,columns)--->DataFrame()
# ------>(rows)--->Series()

In [189]:
bat_company={
    "Bat":["MRF","CEAT","REBOOKE","SS"],
    "Signed":["Virat_Kohli","Rohit_Sharma","Mahendra_singh_Dhoni","Surya_kumar_Yadav"],
    "Game":["ipl","icc","series","county"],
    "Purchase":[20000,15000,10000,12000],
    "Runs":[6,"4_run","2_run","1_run"]
}
idx=["Bat_1","Bat_2","Bat_3","Bat_4"]
company_data=pd.DataFrame(bat_company,index=idx)
company_data.shape
#company_data

(4, 5)

In [192]:
bat_company={
    "Bat":["MRF","CEAT","REBOOKE","SS"],
    "Signed":["Virat_Kohli","Rohit_Sharma","Mahendra_singh_Dhoni","Surya_kumar_Yadav"],
    "Game":["ipl","icc","series","county"],
    "Purchase":[20000,15000,10000,12000],
    "Runs":[6,"4_run","2_run","1_run"]
}
#idx=["Bat_1","Bat_2","Bat_3","Bat_4"]
company_data=pd.Series(bat_company)
company_data.shape
#company_data

(5,)

# index  attribute----->(column name as index)---->Series()
# --------------->(start=0,stop=4,step=1)--------->DataFrame()

In [193]:
bat_company={
    "Bat":["MRF","CEAT","REBOOKE","SS"],
    "Signed":["Virat_Kohli","Rohit_Sharma","Mahendra_singh_Dhoni","Surya_kumar_Yadav"],
    "Game":["ipl","icc","series","county"],
    "Purchase":[20000,15000,10000,12000],
    "Runs":[6,"4_run","2_run","1_run"]
}
#idx=["Bat_1","Bat_2","Bat_3","Bat_4"]
company_data=pd.Series(bat_company)
company_data.index

Index(['Bat', 'Signed', 'Game', 'Purchase', 'Runs'], dtype='object')

In [196]:
bat_company={
    "Bat":["MRF","CEAT","REBOOKE","SS"],
    "Signed":["Virat_Kohli","Rohit_Sharma","Mahendra_singh_Dhoni","Surya_kumar_Yadav"],
    "Game":["ipl","icc","series","county"],
    "Purchase":[20000,15000,10000,12000],
    "Runs":[6,"4_run","2_run","1_run"]
}
#idx=["Bat_1","Bat_2","Bat_3","Bat_4"]
company_data=pd.DataFrame(bat_company)
company_data.index

RangeIndex(start=0, stop=4, step=1)

# Columns attribute------->(column name)---->DataFrame()
# -------no attribute like columns---Series() because of 1D

In [197]:
bat_company={
    "Bat":["MRF","CEAT","REBOOKE","SS"],
    "Signed":["Virat_Kohli","Rohit_Sharma","Mahendra_singh_Dhoni","Surya_kumar_Yadav"],
    "Game":["ipl","icc","series","county"],
    "Purchase":[20000,15000,10000,12000],
    "Runs":[6,"4_run","2_run","1_run"]
}
#idx=["Bat_1","Bat_2","Bat_3","Bat_4"]
company_data=pd.DataFrame(bat_company)
company_data.columns

Index(['Bat', 'Signed', 'Game', 'Purchase', 'Runs'], dtype='object')

In [198]:
bat_company={
    "Bat":["MRF","CEAT","REBOOKE","SS"],
    "Signed":["Virat_Kohli","Rohit_Sharma","Mahendra_singh_Dhoni","Surya_kumar_Yadav"],
    "Game":["ipl","icc","series","county"],
    "Purchase":[20000,15000,10000,12000],
    "Runs":[6,"4_run","2_run","1_run"]
}
#idx=["Bat_1","Bat_2","Bat_3","Bat_4"]
company_data=pd.Series(bat_company)
company_data.columns

AttributeError: 'Series' object has no attribute 'columns'

## .loc[row_name,column_name]
## .iloc[row_index,column_index]

In [201]:
import pandas as pd

df = {
    'Name': ['Talib', 'Anil', 'Raj'],
    'Age': [22, 24, 26],
    'City': ['Rewa', 'Bhopal', 'Indore']
}
index=["a", "b", "c"]
st=pd.DataFrame(df,index=index)
st

    Name  Age    City
a  Talib   22    Rewa
b   Anil   24  Bhopal
c    Raj   26  Indore

In [204]:
import pandas as pd

df = {
    'Name': ['Talib', 'Anil', 'Raj'],
    'Age': [22, 24, 26],
    'City': ['Rewa', 'Bhopal', 'Indore']
}
index=["a", "b", "c"]
st=pd.DataFrame(df,index=index)
st.loc["a","City"]
st.loc["b","Name"]

'Anil'

In [206]:
import pandas as pd

df = {
    'Name': ['Talib', 'Anil', 'Raj'],
    'Age': [22, 24, 26],
    'City': ['Rewa', 'Bhopal', 'Indore']
}
index=["a", "b", "c"]
st=pd.DataFrame(df,index=index)
print(st.iloc[0,1])

22

In [207]:
import pandas as pd

df = {
    'Name': ['Talib', 'Anil', 'Raj'],
    'Age': [22, 24, 26],
    'City': ['Rewa', 'Bhopal', 'Indore']
}
index=["a", "b", "c"]
st=pd.DataFrame(df,index=index)
st["Name"]

a    Talib
b     Anil
c      Raj
Name: Name, dtype: object

In [226]:
import pandas as pd

df = {
    'Name': ['Talib', 'Anil', 'Raj'],
    'Age': [22, 24, 26],
    'City': ['Rewa', 'Bhopal', 'Indore']
}
df["Capacity"]=[20000,300000,1200000]
df
index=["a", "b", "c"]
st=pd.DataFrame(df,index=index)
st[["Name","Age"]]

    Name  Age
a  Talib   22
b   Anil   24
c    Raj   26

In [227]:
st[st["Age"]>24]

  Name  Age    City  Capacity
c  Raj   26  Indore   1200000

In [228]:
st[st["Name"]=="Talib"]

    Name  Age  City  Capacity
a  Talib   22  Rewa     20000

In [229]:
df["Capacity"]=[20000,300000,1200000]
df

{'Name': ['Talib', 'Anil', 'Raj'],
 'Age': [22, 24, 26],
 'City': ['Rewa', 'Bhopal', 'Indore'],
 'Capacity': [20000, 300000, 1200000]}

In [230]:
st

    Name  Age    City  Capacity
a  Talib   22    Rewa     20000
b   Anil   24  Bhopal    300000
c    Raj   26  Indore   1200000

# series

In [165]:
import pandas as pd
Purchase=[20000,15000,10000,12000]
data=pd.Series(Purchase)
data

0    20000
1    15000
2    10000
3    12000
dtype: int64

In [167]:
import pandas as pd
Purchase=[20000,15000,10000,12000]
idx=["p1","p2","p3","p4"]
data=pd.Series(Purchase,index=idx)
data

p1    20000
p2    15000
p3    10000
p4    12000
dtype: int64

In [168]:
import pandas as pd
Purchase=[20000,15000,10000,12000]
idx=["p1","p2","p3","p4"]
data=pd.Series(Purchase,index=idx)
data.head(2)

p1    20000
p2    15000
dtype: int64

In [169]:
import pandas as pd
Purchase=[20000,15000,10000,12000]
idx=["p1","p2","p3","p4"]
data=pd.Series(Purchase,index=idx)
data.tail(3)

p2    15000
p3    10000
p4    12000
dtype: int64

In [171]:
import pandas as pd
Purchase=[20000,15000,10000,12000]
idx=["p1","p2","p3","p4"]
data=pd.Series(Purchase,index=idx)
print(data.describe())

count        4.00000
mean     14250.00000
std       4349.32945
min      10000.00000
25%      11500.00000
50%      13500.00000
75%      16250.00000
max      20000.00000
dtype: float64

In [172]:
import pandas as pd
Purchase=[20000,15000,10000,12000]
idx=["p1","p2","p3","p4"]
data=pd.Series(Purchase,index=idx)
data.info()

<class 'pandas.core.series.Series'>
Index: 4 entries, p1 to p4
Series name: None
Non-Null Count  Dtype
--------------  -----
4 non-null      int64
dtypes: int64(1)
memory usage: 64.0+ bytes

In [173]:
import pandas as pd
ball={'bat': 'mrf',
 'signed': 'virat',
 'purachse': 200,
 'ball': 'kukuborra',
 'weight': 200,
 'price': 3000
     }
ball_data=pd.Series(ball)
ball_data

bat               mrf
signed          virat
purachse          200
ball        kukuborra
weight            200
price            3000
dtype: object

In [176]:
import pandas as pd
ball={'bat': 'mrf',
 'signed': 'virat',
 'purachse': 200,
 'ball': 'kukuborra',
 'weight': 200,
 'price': 3000
     }
idx=["c_det_1","c_det_2","c_det_3","c_det_4"]
ball_data=pd.Series(ball,index=idx)
print(ball_data)

c_det_1    NaN
c_det_2    NaN
c_det_3    NaN
c_det_4    NaN
dtype: object

In [177]:
import pandas as pd
ball={'bat': 'mrf',
 'signed': 'virat',
 'purachse': 200,
 'ball': 'kukuborra',
 'weight': 200,
 'price': 3000
     }
idx=["c_det_1","c_det_2","c_det_3","c_det_4"]
ball_data=pd.DataFrame(ball,index=idx)
ball_data

         bat signed  purachse       ball  weight  price
c_det_1  mrf  virat       200  kukuborra     200   3000
c_det_2  mrf  virat       200  kukuborra     200   3000
c_det_3  mrf  virat       200  kukuborra     200   3000
c_det_4  mrf  virat       200  kukuborra     200   3000

In [178]:
import pandas as pd
ball={'bat': 'mrf',
 'signed': 'virat',
 'purachse': 200,
 'ball': 'kukuborra',
 'weight': 200,
 'price': 3000
     }
idx=["c_det_1","c_det_2","c_det_3","c_det_4"]
ball_data=pd.DataFrame(ball,index=idx)
ball_data.describe()

       purachse  weight   price
count       4.0     4.0     4.0
mean      200.0   200.0  3000.0
std         0.0     0.0     0.0
min       200.0   200.0  3000.0
25%       200.0   200.0  3000.0
50%       200.0   200.0  3000.0
75%       200.0   200.0  3000.0
max       200.0   200.0  3000.0

In [179]:
import pandas as pd
list_name=["talib","ansari","vipul","singh"]
name=pd.DataFrame(list_name)
name

        0
0   talib
1  ansari
2   vipul
3   singh

In [180]:
import pandas as pd
list_name=["talib","ansari","vipul","singh"]
idx=["name_1","name_2","name_3","name_4"]
name=pd.DataFrame(list_name,index=idx)
name

             0
name_1   talib
name_2  ansari
name_3   vipul
name_4   singh

In [5]:
import pandas as pd
df=pd.read_csv(r"C:\Users\talib\Downloads\pandas_large_practice_data.csv")
print(df.head())

    Name  Age     City Country  Marks Passed
0   Aman   27   Indore   India     54    Yes
1   Aman   18  Lucknow   India     52    Yes
2  Priya   33     Rewa   India     88    Yes
3   Zaid   21    Patna   India     58    Yes
4  Talib   30    Delhi   India     86    Yes

In [6]:
import pandas as pd
df=pd.read_csv(r"C:\Users\talib\Downloads\pandas_large_practice_data.csv")
df.shape

(100, 6)

In [9]:
import pandas as pd
df=pd.read_csv(r"C:\Users\talib\Downloads\pandas_large_practice_data.csv")
df

     Name  Age     City Country  Marks Passed
0    Aman   27   Indore   India     54    Yes
1    Aman   18  Lucknow   India     52    Yes
2   Priya   33     Rewa   India     88    Yes
3    Zaid   21    Patna   India     58    Yes
4   Talib   30    Delhi   India     86    Yes
..    ...  ...      ...     ...    ...    ...
95  Talib   26   Bhopal   India     65     No
96  Sneha   26   Jaipur   India     83    Yes
97  Talib   18   Indore   India     97     No
98   Anil   18     Rewa   India     85    Yes
99  Talib   21    Delhi   India     78    Yes

[100 rows x 6 columns]

In [10]:
import pandas as pd
df=pd.read_csv(r"C:\Users\talib\Downloads\pandas_large_practice_data.csv")
df.describe()

              Age       Marks
count  100.000000  100.000000
mean    25.740000   75.360000
std      5.392887   14.338984
min     18.000000   50.000000
25%     21.000000   64.000000
50%     25.000000   75.000000
75%     30.000000   87.000000
max     35.000000  100.000000

In [11]:
import pandas as pd
df=pd.read_csv(r"C:\Users\talib\Downloads\pandas_large_practice_data.csv")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     100 non-null    object
 1   Age      100 non-null    int64
 2   City     100 non-null    object
 3   Country  100 non-null    object
 4   Marks    100 non-null    int64
 5   Passed   100 non-null    object
dtypes: int64(2), object(4)
memory usage: 4.8+ KB

In [15]:
import pandas as pd
df=pd.read_csv(r"C:\Users\talib\Downloads\pandas_large_practice_data.csv")
print(df.loc[0,"Age"])

27

In [16]:
import pandas as pd
df=pd.read_csv(r"C:\Users\talib\Downloads\pandas_large_practice_data.csv")
df["Name"]

0      Aman
1      Aman
2     Priya
3      Zaid
4     Talib
      ...
95    Talib
96    Sneha
97    Talib
98     Anil
99    Talib
Name: Name, Length: 100, dtype: object

In [19]:
import pandas as pd
df=pd.read_csv(r"C:\Users\talib\Downloads\pandas_large_practice_data.csv")
pd.set_option('display.max_rows', 200)
df

     Name  Age     City Country  Marks Passed
0    Aman   27   Indore   India     54    Yes
1    Aman   18  Lucknow   India     52    Yes
2   Priya   33     Rewa   India     88    Yes
3    Zaid   21    Patna   India     58    Yes
4   Talib   30    Delhi   India     86    Yes
5   Priya   27   Bhopal   India     78     No
6   Talib   20    Patna   India     90     No
7    Anil   33     Rewa   India     65    Yes
8    Zaid   26   Jaipur   India     72    Yes
9     Raj   27   Bhopal   India     71    Yes
10  Sonal   18     Rewa   India     70     No
11    Raj   23   Bhopal   India     80     No
12   Anil   23  Lucknow   India     87     No
13   Anil   19  Kolkata   India     59     No
14    Raj   25     Pune   India     98     No
15   Aman   35  Lucknow   India     85    Yes
16   Zaid   23     Rewa   India     81     No
17  Talib   30   Bhopal   India     79     No
18   Ravi   22   Indore   India     82     No
19   Zaid   21     Pune   India     95     No
20  Priya   34   Indore   India     62     No
21   Aman   21    Patna   India     96    Yes
22   Zaid   27   Indore   India    100     No
23  Nisha   23   Bhopal   India     59    Yes
24   Zaid   22    Patna   India     67     No
25    Raj   33    Delhi   India     66     No
26  Talib   34   Indore   India     72     No
27    Raj   19   Mumbai   India     90    Yes
28   Aman   27  Lucknow   India     83     No
29  Sonal   30   Mumbai   India     73    Yes
30  Sneha   30     Pune   India     71     No
31  Priya   33  Lucknow   India     61     No
32  Nisha   31     Rewa   India     57    Yes
33  Priya   35   Mumbai   India     85    Yes
34    Raj   21  Lucknow   India     54     No
35   Anil   24    Delhi   India     83    Yes
36  Sonal   22   Bhopal   India     79    Yes
37  Sonal   27     Rewa   India     69     No
38    Raj   29   Mumbai   India     65    Yes
39   Anil   19   Mumbai   India     89    Yes
40  Priya   35   Bhopal   India     89    Yes
41  Sneha   35   Mumbai   India     91     No
42  Sonal   35     Rewa   India     90     No
43    Raj   23     Pune   India     67    Yes
44    Raj   24   Jaipur   India     50     No
45  Talib   20   Jaipur   India     64     No
46  Priya   24     Rewa   India     60     No
47   Anil   35   Mumbai   India     68    Yes
48  Sneha   26   Indore   India     79     No
49   Ravi   20   Mumbai   India     67    Yes
50  Nisha   29  Kolkata   India     73     No
51  Sneha   34    Patna   India     84     No
52    Raj   31     Pune   India     79     No
53   Zaid   30     Pune   India     85    Yes
54  Talib   31     Pune   India     59    Yes
55  Talib   24    Delhi   India     99    Yes
56    Raj   23   Bhopal   India     58     No
57  Talib   32   Jaipur   India     54    Yes
58   Zaid   30     Pune   India     66     No
59  Talib   19    Delhi   India     62     No
60  Nisha   26  Kolkata   India     96    Yes
61   Zaid   21   Mumbai   India     57    Yes
62  Priya   19    Delhi   India     87    Yes
63   Anil   26     Pune   India     53     No
64   Zaid   23   Indore   India     74     No
65   Ravi   23     Rewa   India     97    Yes
66  Nisha   21  Lucknow   India     62    Yes
67  Sneha   34     Pune   India     60    Yes
68  Sneha   33    Patna   India     72     No
69  Nisha   22  Kolkata   India     82    Yes
70    Raj   27   Indore   India     67     No
71   Aman   27   Jaipur   India     89    Yes
72  Nisha   23  Kolkata   India     51    Yes
73   Aman   25  Lucknow   India     91     No
74    Raj   27  Lucknow   India     79     No
75    Raj   20    Delhi   India     86    Yes
76  Sneha   34   Indore   India     64    Yes
77  Sonal   23     Pune   India     68    Yes
78   Aman   20  Kolkata   India     80     No
79  Nisha   18   Indore   India     76    Yes
80  Sonal   25     Rewa   India     98     No
81  Sneha   32    Delhi   India     51     No
82   Aman   29   Bhopal   India     61    Yes
83   Anil   19   Mumbai   India     97    Yes
84  Talib   24   Mumbai   India     66     No
85  Nisha   19   Jaipur   India     81     No
86  Talib   22     Pune   India    100     No
87  Talib   20   Indore   India     96     No
88  Priya   33   Jaipur   India     54    Yes
89  Sonal   23   Jaipur   India     99     No
90   Ravi   20   Indore   India     64     No
91   Zaid   19  Lucknow   India     69    Yes
92    Raj   19  Kolkata   India     95    Yes
93   Ravi   35    Delhi   India     59     No
94   Aman   32   Indore   India     92     No
95  Talib   26   Bhopal   India     65     No
96  Sneha   26   Jaipur   India     83    Yes
97  Talib   18   Indore   India     97     No
98   Anil   18     Rewa   India     85    Yes
99  Talib   21    Delhi   India     78    Yes

In [20]:
import pandas as pd
df=pd.read_csv(r"C:\Users\talib\Downloads\pandas_large_practice_data.csv")
pd.set_option('display.max_rows', 200)
df["Name"]

0      Aman
1      Aman
2     Priya
3      Zaid
4     Talib
5     Priya
6     Talib
7      Anil
8      Zaid
9       Raj
10    Sonal
11      Raj
12     Anil
13     Anil
14      Raj
15     Aman
16     Zaid
17    Talib
18     Ravi
19     Zaid
20    Priya
21     Aman
22     Zaid
23    Nisha
24     Zaid
25      Raj
26    Talib
27      Raj
28     Aman
29    Sonal
30    Sneha
31    Priya
32    Nisha
33    Priya
34      Raj
35     Anil
36    Sonal
37    Sonal
38      Raj
39     Anil
40    Priya
41    Sneha
42    Sonal
43      Raj
44      Raj
45    Talib
46    Priya
47     Anil
48    Sneha
49     Ravi
50    Nisha
51    Sneha
52      Raj
53     Zaid
54    Talib
55    Talib
56      Raj
57    Talib
58     Zaid
59    Talib
60    Nisha
61     Zaid
62    Priya
63     Anil
64     Zaid
65     Ravi
66    Nisha
67    Sneha
68    Sneha
69    Nisha
70      Raj
71     Aman
72    Nisha
73     Aman
74      Raj
75      Raj
76    Sneha
77    Sonal
78     Aman
79    Nisha
80    Sonal
81    Sneha
82     Aman
83     Anil
84    Talib
85    Nisha
86    Talib
87    Talib
88    Priya
89    Sonal
90     Ravi
91     Zaid
92      Raj
93     Ravi
94     Aman
95    Talib
96    Sneha
97    Talib
98     Anil
99    Talib
Name: Name, dtype: object

In [21]:
pd.reset_option('display.max_rows')

In [22]:
import pandas as pd
df=pd.read_csv(r"C:\Users\talib\Downloads\pandas_large_practice_data.csv")
print(df.to_string())

     Name  Age     City Country  Marks Passed
0    Aman   27   Indore   India     54    Yes
1    Aman   18  Lucknow   India     52    Yes
2   Priya   33     Rewa   India     88    Yes
3    Zaid   21    Patna   India     58    Yes
4   Talib   30    Delhi   India     86    Yes
5   Priya   27   Bhopal   India     78     No
6   Talib   20    Patna   India     90     No
7    Anil   33     Rewa   India     65    Yes
8    Zaid   26   Jaipur   India     72    Yes
9     Raj   27   Bhopal   India     71    Yes
10  Sonal   18     Rewa   India     70     No
11    Raj   23   Bhopal   India     80     No
12   Anil   23  Lucknow   India     87     No
13   Anil   19  Kolkata   India     59     No
14    Raj   25     Pune   India     98     No
15   Aman   35  Lucknow   India     85    Yes
16   Zaid   23     Rewa   India     81     No
17  Talib   30   Bhopal   India     79     No
18   Ravi   22   Indore   India     82     No
19   Zaid   21     Pune   India     95     No
20  Priya   34   Indore   India     62     No
21   Aman   21    Patna   India     96    Yes
22   Zaid   27   Indore   India    100     No
23  Nisha   23   Bhopal   India     59    Yes
24   Zaid   22    Patna   India     67     No
25    Raj   33    Delhi   India     66     No
26  Talib   34   Indore   India     72     No
27    Raj   19   Mumbai   India     90    Yes
28   Aman   27  Lucknow   India     83     No
29  Sonal   30   Mumbai   India     73    Yes
30  Sneha   30     Pune   India     71     No
31  Priya   33  Lucknow   India     61     No
32  Nisha   31     Rewa   India     57    Yes
33  Priya   35   Mumbai   India     85    Yes
34    Raj   21  Lucknow   India     54     No
35   Anil   24    Delhi   India     83    Yes
36  Sonal   22   Bhopal   India     79    Yes
37  Sonal   27     Rewa   India     69     No
38    Raj   29   Mumbai   India     65    Yes
39   Anil   19   Mumbai   India     89    Yes
40  Priya   35   Bhopal   India     89    Yes
41  Sneha   35   Mumbai   India     91     No
42  Sonal   35     Rewa   India     90     No
43    Raj   23     Pune   India     67    Yes
44    Raj   24   Jaipur   India     50     No
45  Talib   20   Jaipur   India     64     No
46  Priya   24     Rewa   India     60     No
47   Anil   35   Mumbai   India     68    Yes
48  Sneha   26   Indore   India     79     No
49   Ravi   20   Mumbai   India     67    Yes
50  Nisha   29  Kolkata   India     73     No
51  Sneha   34    Patna   India     84     No
52    Raj   31     Pune   India     79     No
53   Zaid   30     Pune   India     85    Yes
54  Talib   31     Pune   India     59    Yes
55  Talib   24    Delhi   India     99    Yes
56    Raj   23   Bhopal   India     58     No
57  Talib   32   Jaipur   India     54    Yes
58   Zaid   30     Pune   India     66     No
59  Talib   19    Delhi   India     62     No
60  Nisha   26  Kolkata   India     96    Yes
61   Zaid   21   Mumbai   India     57    Yes
62  Priya   19    Delhi   India     87    Yes
63   Anil   26     Pune   India     53     No
64   Zaid   23   Indore   India     74     No
65   Ravi   23     Rewa   India     97    Yes
66  Nisha   21  Lucknow   India     62    Yes
67  Sneha   34     Pune   India     60    Yes
68  Sneha   33    Patna   India     72     No
69  Nisha   22  Kolkata   India     82    Yes
70    Raj   27   Indore   India     67     No
71   Aman   27   Jaipur   India     89    Yes
72  Nisha   23  Kolkata   India     51    Yes
73   Aman   25  Lucknow   India     91     No
74    Raj   27  Lucknow   India     79     No
75    Raj   20    Delhi   India     86    Yes
76  Sneha   34   Indore   India     64    Yes
77  Sonal   23     Pune   India     68    Yes
78   Aman   20  Kolkata   India     80     No
79  Nisha   18   Indore   India     76    Yes
80  Sonal   25     Rewa   India     98     No
81  Sneha   32    Delhi   India     51     No
82   Aman   29   Bhopal   India     61    Yes
83   Anil   19   Mumbai   India     97    Yes
84  Talib   24   Mumbai   India     66     No
85  Nisha   19   Jaipur   India     81     No
86  Talib   22     Pune   India    100     No
87  Talib   20   Indore   India     96     No
88  Priya   33   Jaipur   India     54    Yes
89  Sonal   23   Jaipur   India     99     No
90   Ravi   20   Indore   India     64     No
91   Zaid   19  Lucknow   India     69    Yes
92    Raj   19  Kolkata   India     95    Yes
93   Ravi   35    Delhi   India     59     No
94   Aman   32   Indore   India     92     No
95  Talib   26   Bhopal   India     65     No
96  Sneha   26   Jaipur   India     83    Yes
97  Talib   18   Indore   India     97     No
98   Anil   18     Rewa   India     85    Yes
99  Talib   21    Delhi   India     78    Yes

In [25]:
import pandas as pd
kirana=pd.read_csv(r"C:\Users\talib\Downloads\kirana_shopping_data.csv")
pd.set_option('display.max_rows', 200)
kirana

,Customer,Product,Quantity,Price_per_unit,Store,Payment_Method,Date,Total_Amount
0,Talib,Shampoo,7,120,Kirana Express,Card,2025-07-01,840
1,Raj,Wheat,5,479,Fresh Market,Cash,2025-07-02,2395
2,Priya,Sugar,10,214,Daily Mart,Card,2025-07-03,2140
3,Nisha,Soap,9,15,Kirana Express,Card,2025-07-04,135
4,Talib,Soap,9,352,Fresh Market,UPI,2025-07-05,3168
5,Ravi,Tea,3,54,Fresh Market,Cash,2025-07-06,162
6,Anil,Wheat,7,331,Fresh Market,Cash,2025-07-07,2317
7,Priya,Salt,6,121,Daily Mart,Card,2025-07-08,726
8,Raj,Oil,6,303,Kirana Express,UPI,2025-07-09,1818
9,Anil,Soap,9,312,Kirana Express,Card,2025-07-10,2808
10,Talib,Oil,9,364,Fresh Market,Card,2025-07-11,3276
11,Zaid,Shampoo,5,205,Daily Mart,UPI,2025-07-12,1025
12,Priya,Sugar,10,345,Kirana Express,Cash,2025-07-13,3450
13,Anil,Oil,5,263,Daily Mart,Card,2025-07-14,1315
14,Aman,Milk,1,169,Kirana Express,Cash,2025-07-15,169
15,Zaid,Soap,9,457,Daily Mart,Card,2025-07-16,4113
16,Raj,Toothpaste,2,414,Fresh Market,UPI,2025-07-17,828
17,Zaid,Tea,6,435,Smart Store,UPI,2025-07-18,2610
18,Priya,Rice,5,371,Kirana Express,UPI,2025-07-19,1855
19,Raj,Toothpaste,4,217,Daily Mart,UPI,2025-07-20,868
20,Talib,Wheat,7,194,Kirana Express,UPI,2025-07-21,1358
21,Talib,Tea,5,179,Smart Store,UPI,2025-07-22,895
22,Sneha,Oil,2,143,Smart Store,Cash,2025-07-23,286
23,Ravi,Sugar,10,416,Kirana Express,Cash,2025-07-24,4160
24,Zaid,Soap,5,355,Smart Store,Card,2025-07-25,1775
25,Sneha,Wheat,9,328,Smart Store,UPI,2025-07-26,2952
26,Talib,Soap,4,379,Smart Store,Cash,2025-07-27,1516
27,Zaid,Wheat,3,301,Kirana Express,Card,2025-07-28,903
28,Priya,Oil,8,201,Kirana Express,UPI,2025-07-29,1608
29,Raj,Salt,3,237,Kirana Express,Cash,2025-07-30,711
30,Priya,Sugar,7,72,Fresh Market,UPI,2025-07-31,504
31,Aman,Rice,3,138,Daily Mart,Card,2025-08-01,414
32,Anil,Shampoo,3,57,Fresh Market,Cash,2025-08-02,171
33,Sneha,Milk,1,428,Fresh Market,Cash,2025-08-03,428
34,Talib,Oil,4,99,Kirana Express,Card,2025-08-04,396
35,Aman,Tea,2,390,Smart Store,UPI,2025-08-05,780
36,Ravi,Tea,7,386,Smart Store,Cash,2025-08-06,2702
37,Talib,Rice,7,389,Daily Mart,UPI,2025-08-07,2723
38,Raj,Salt,1,62,Fresh Market,Cash,2025-08-08,62
39,Priya,Oil,8,229,Smart Store,UPI,2025-08-09,1832
40,Aman,Soap,6,201,Daily Mart,Cash,2025-08-10,1206
41,Ravi,Tea,6,335,Daily Mart,UPI,2025-08-11,2010
42,Ravi,Tea,8,63,Smart Store,UPI,2025-08-12,504
43,Raj,Salt,4,474,Fresh Market,Card,2025-08-13,1896
44,Nisha,Shampoo,4,65,Smart Store,Card,2025-08-14,260
45,Talib,Toothpaste,7,427,Fresh Market,Card,2025-08-15,2989
46,Ravi,Soap,6,131,Fresh Market,Cash,2025-08-16,786
47,Nisha,Rice,2,428,Kirana Express,UPI,2025-08-17,856
48,Talib,Toothpaste,6,109,Kirana Express,Cash,2025-08-18,654
49,Sonal,Sugar,2,426,Kirana Express,Cash,2025-08-19,852
50,Raj,Salt,6,24,Fresh Market,Cash,2025-08-20,144
51,Sneha,Shampoo,6,313,Smart Store,Cash,2025-08-21,1878
52,Nisha,Rice,1,117,Daily Mart,UPI,2025-08-22,117
53,Nisha,Shampoo,4,341,Kirana Express,Card,2025-08-23,1364
54,Sneha,Wheat,10,140,Daily Mart,UPI,2025-08-24,1400
55,Nisha,Salt,3,188,Fresh Market,Cash,2025-08-25,564
56,Anil,Oil,8,77,Fresh Market,UPI,2025-08-26,616
57,Priya,Soap,9,485,Daily Mart,UPI,2025-08-27,4365
58,Sonal,Milk,5,413,Kirana Express,Card,2025-08-28,2065
59,Nisha,Rice,8,49,Fresh Market,Card,2025-08-29,392
60,Zaid,Oil,3,490,Daily Mart,UPI,2025-08-30,1470
61,Aman,Milk,9,427,Daily Mart,Cash,2025-08-31,3843
62,Talib,Sugar,8,244,Kirana Express,Card,2025-09-01,1952
63,Nisha,Shampoo,4,445,Smart Store,Cash,2025-09-02,1780
64,Raj,Toothpaste,1,256,Fresh Market,Cash,2025-09-03,256
65,Nisha,Milk,10,41,Daily Mart,Cash,2025-09-04,410
66,Aman,Salt,2,115,Fresh Market,Card,2025-09-05,230
67,Talib,Wheat,10,147,Kirana Express,Card,2025-09-06,1470
68,Ravi,Wheat,8,444,Kirana Express,UPI,2025-09-07,3552
69,Sonal,Salt,3,124,Daily Mart,Cash,2025-09-08,372
70,Ravi,Rice,1,46,Daily Mart,Card,2025-09-09,46
71,Talib,Toothpaste,6,87,Smart Store,Cash,2025-09-10,522
72,Talib,Sugar,9,128,Daily Mart,Cash,2025-09-11,1152
73,Raj,Sugar,4,190,Daily Mart,Card,2025-09-12,760
74,Aman,Toothpaste,5,494,Daily Mart,UPI,2025-09-13,2470
75,Nisha,Tea,10,30,Kirana Express,UPI,2025-09-14,300
76,Ravi,Tea,1,192,Daily Mart,UPI,2025-09-15,192
77,Raj,Toothpaste,4,122,Smart Store,UPI,2025-09-16,488
78,Nisha,Rice,8,12,Fresh Market,Card,2025-09-17,96
79,Anil,Tea,10,415,Daily Mart,UPI,2025-09-18,4150
80,Sonal,Oil,7,340,Daily Mart,UPI,2025-09-19,2380
81,Ravi,Toothpaste,1,216,Smart Store,Card,2025-09-20,216
82,Anil,Oil,10,219,Smart Store,Card,2025-09-21,2190
83,Aman,Milk,1,393,Daily Mart,Card,2025-09-22,393
84,Sneha,Oil,3,208,Fresh Market,UPI,2025-09-23,624
85,Sneha,Soap,10,143,Kirana Express,UPI,2025-09-24,1430
86,Ravi,Salt,8,72,Kirana Express,Card,2025-09-25,576
87,Raj,Sugar,1,454,Smart Store,Card,2025-09-26,454
88,Ravi,Oil,2,194,Daily Mart,UPI,2025-09-27,388
89,Sonal,Rice,2,61,Kirana Express,Card,2025-09-28,122
90,Zaid,Sugar,4,49,Kirana Express,Cash,2025-09-29,196
91,Ravi,Milk,9,432,Smart Store,UPI,2025-09-30,3888
92,Anil,Soap,2,110,Kirana Express,UPI,2025-10-01,220
93,Zaid,Shampoo,8,287,Fresh Market,Card,2025-10-02,2296
94,Nisha,Sugar,9,89,Daily Mart,Card,2025-10-03,801
95,Raj,Shampoo,4,83,Fresh Market,Card,2025-10-04,332
96,Priya,Sugar,6,73,Fresh Market,Cash,2025-10-05,438
97,Nisha,Tea,10,206,Kirana Express,Cash,2025-10-06,2060
98,Nisha,Shampoo,6,274,Kirana Express,Cash,2025-10-07,1644
99,Nisha,Oil,4,396,Kirana Express,UPI,2025-10-08,1584

In [26]:
pd.reset_option('display.max_rows')